"""
Даны два массива aи bнапишите функцию comp(a, b)(или compSame(a, b)), 
которая проверяет, имеют ли два массива «одинаковые» элементы 
с одинаковой кратностью . «Одинаковый» здесь означает, 
что элементы в b- это элементы в aквадрате, независимо от порядка.

Примеры
Допустимые массивы
a = [121, 144, 19, 161, 19, 144, 19, 11]  
b = [121, 14641, 20736, 361, 25921, 361, 20736, 361]
comp(a, b)возвращает true, потому что b121 - квадрат 11, 
14641 - квадрат 121, 20736 - квадрат 144, 361 - квадрат 19, 
25921 - квадрат 161 и т. д. Это станет очевидным, 
если мы запишем bэлементы в квадратах:

a = [121, 144, 19, 161, 19, 144, 19, 11] 
b = [11*11, 121*121, 144*144, 19*19, 161*161, 19*19, 144*144, 19*19]
"""
import collections as col
def main():
    a = [121, 144, 19, 161, 19, 144, 19, 11]  
    b = [121, 14641, 20736, 361, 25921, 361, 20736, 361]
    print(comp(a,b))

def comp(array1, array2):
    #v2
    # if len(array1)==0 or len(array2)==0:
    #     return False
    try:
        ln = [i**2 for i in array1]
        return True if col.Counter(ln) == col.Counter(array2) else False
    except Exception as ex:
        return ex

    #v1
    # ln = [array1[i]**2 for i in range(len(array1))]
    # return True if set(ln) == set(array2) else False
	

main()